#include "app_delay.h"

/**************************************************************************************************
* 版本：V1.00
* 日期：2024-10-01
* 功能：软件延时
* 更新：初始版本
* 作者：专业理工男
**************************************************************************************************/

/**************************************************************************************************
* 功能：软件延时
* 参数：ms,要延时的ms数
* 描述：这里只支持1~255ms，自动适应主时钟
**************************************************************************************************/
void delay_ms(u8 ms)
{
	u16 i;
	do
	{
		i = MAIN_Fosc / 6000;
		while(--i);
	}
	while(--ms);
}

/**************************************************************************************************
* 功能：软件延时
* 参数：无
* 描述：8051指令集：AI32
**************************************************************************************************/
void Delay500ms(void)	//@22.1184MHz
{
	unsigned long edata i;

	_nop_();
	_nop_();
	i = 2764798UL;
	while (i) i--;
}

void Delay20us(void)	//@22.1184MHz
{
	unsigned long edata i;

	_nop_();
	i = 109UL;
	while (i) i--;
}

void Delay4us(void)	//@22.1184MHz
{
	unsigned long edata i;

	_nop_();
	_nop_();
	_nop_();
	i = 20UL;
	while (i) i--;
}

void Delay2us(void)	//@22.1184MHz
{
	unsigned long edata i;

	_nop_();
	_nop_();
	_nop_();
	i = 9UL;
	while (i) i--;
}

void Delay1us(void)	//@22.1184MHz
{
	unsigned long edata i;

	_nop_();
	i = 4UL;
	while (i) i--;
}
