#include "app_iic.h"

/**************************************************************************************************
* 版本：V1.00
* 日期：2024-10-01
* 功能：IIC协议
* 更新：初始版本
* 作者：专业理工男
**************************************************************************************************/

/**************************************************************************************************
* 功能：IIC初始化
* 参数：无
* 描述：无
**************************************************************************************************/
void IIC_Init(void)
{
	SDA = 1;
	SCL = 1;
}

//**************************************
//I2C起始信号
//**************************************
void I2C_Start(void)
{
	Delay4us();                 //延时
	SDA = 1;                    //拉高数据线
	SCL = 1;                    //拉高时钟线
	Delay4us();                 //延时
	SDA = 0;                    //产生下降沿
	Delay2us();                 //延时
	SCL = 0;                    //拉低时钟线
	Delay2us();                 //延时
}

//**************************************
//I2C停止信号
//**************************************
void I2C_Stop(void)
{
    Delay2us();                 //延时
    SDA = 0;                    //拉低数据线
    SCL = 1;                    //拉高时钟线
	Delay2us();                 //延时
    SDA = 1;                    //产生上升沿
	Delay2us();                 //延时
}

//**************************************
//I2C接收应答信号
//**************************************
bit I2C_RecvACK(void)
{
	SDA = 1;
	Delay2us();                 //延时
    SCL = 1;                    //拉高时钟线
    Delay2us();                 //延时
    CY = SDA;                   //读应答信号
    SCL = 0;                    //拉低时钟线
    Delay2us();                 //延时
    return CY;
}

//**************************************
//向I2C总线发送一个字节数据
//**************************************
void I2C_SendByte(u8 dat)
{
    u8 i;
	SCL = 0;
    for (i=0; i<8; i++)         //8位计数器
    {
        dat <<= 1;              //移出数据的最高位
        SDA = CY;               //送数据口
		Delay2us();
        SCL = 1;                //拉高时钟线
        Delay2us();             //延时
        SCL = 0;                //拉低时钟线
        Delay2us();             //延时
    }
    I2C_RecvACK();
}

//**************************************
//从I2C总线接收一个字节数据
//**************************************
u8 I2C_RecvByte(void)
{
    u8 i;
    u8 dat = 0;
    SDA = 1;                    //使能内部上拉,准备读取数据,
    for (i=0; i<8; i++)         //8位计数器
    {
        dat <<= 1;
        SCL = 1;                //拉高时钟线
        Delay2us();             //延时
        dat |= SDA;             //读数据
        SCL = 0;                //拉低时钟线
        Delay2us();             //延时
    }
    return dat;
}
