#include "app_motor.h"

/**************************************************************************************************
* 版本：V1.00
* 日期：2024-10-01
* 功能：电机控制
* 更新：初始版本
* 作者：专业理工男
**************************************************************************************************/

/**************************************************************************************************
* 功能：电机控制初始化
* 参数：无
* 描述：无
**************************************************************************************************/
void Motor_Init(void)
{
	PWMA_CCER1 = 0x00; //写 CCMRx 前必须先清零 CCxE 关闭通道
    PWMA_CCER2 = 0x00;
    PWMA_CCMR1 = 0x60; //通道模式配置
    PWMA_CCMR2 = 0x60;
    PWMA_CCMR3 = 0x60;
    PWMA_CCMR4 = 0x60;
    PWMA_CCER1 = 0x11; //配置通道输出使能和极性
    PWMA_CCER2 = 0x11;
	
	PWMA_CCMR1 |= 0x08; //开启PWMA_CCR1预转载功能(需要CC1E=1才可写)
    PWMA_CCMR2 |= 0x08;
    PWMA_CCMR3 |= 0x08;
    PWMA_CCMR4 |= 0x08;
	
	PWMA_ARRH = (u8)(PWM_PERIOD >> 8); //设置周期时间
    PWMA_ARRL = (u8)PWM_PERIOD;
	
	PWMA_ENO = 0x00;
    PWMA_ENO |= ENO1P; //使能输出
    PWMA_ENO |= ENO2P; //使能输出
    PWMA_ENO |= ENO3P; //使能输出
    PWMA_ENO |= ENO4P; //使能输出
	
	PWMA_PS = 0x00;  //高级 PWM 通道输出脚选择位
    PWMA_PS |= PWM1_2; //选择 PWM1_2 通道
    PWMA_PS |= PWM2_2; //选择 PWM2_2 通道
    PWMA_PS |= PWM3_1; //选择 PWM3_1 通道
    PWMA_PS |= PWM4_1; //选择 PWM4_1 通道
	
	PWMA_BKR = 0x80;  //使能主输出
    PWMA_CR1 |= 0x81; //使能ARR预装载,开始计时
}

/**************************************************************************************************
* 功能：电机控制任务
* 参数：无
* 描述：无
**************************************************************************************************/
void Motor_Task(void)
{
	PWM_Output();		//PWM输出
}

/**************************************************************************************************
* 功能：PWM输出
* 参数：无
* 描述：无
**************************************************************************************************/
void PWM_Output(void)
{
	PWMA_CCR1H = (u8)(run.motor_speed[0] >> 8); //设置占空比时间,M1
    PWMA_CCR1L = (u8)(run.motor_speed[0]);
    PWMA_CCR2H = (u8)(run.motor_speed[1] >> 8); //设置占空比时间,M2
    PWMA_CCR2L = (u8)(run.motor_speed[1]);
    PWMA_CCR3H = (u8)(run.motor_speed[2] >> 8); //设置占空比时间,M3
    PWMA_CCR3L = (u8)(run.motor_speed[2]);
    PWMA_CCR4H = (u8)(run.motor_speed[3] >> 8); //设置占空比时间,M4
    PWMA_CCR4L = (u8)(run.motor_speed[3]);
}
