#include "params.h"

/**************************************************************************************************
* 版本：V1.00
* 日期：2024-10-01
* 功能：参数初始化
* 更新：初始版本
* 作者：专业理工男
**************************************************************************************************/

//结构体参数定义
SYS_T sys;
RUN_T run;

//结构体参数指针定义
uint16_t *p_sys;
uint16_t *p_run;

/**************************************************************************************************
* 功能：参数始化
* 参数：无
* 描述：无
**************************************************************************************************/
void Params_Init(void)
{
	delay_ms(100);					//防止系统不稳定时存储参数出现异常
	p_sys = &sys.debug1;
	p_run = &run.debug1;
	
	Sys_Params_Load();				//系统参数加载
	Run_Params_Init();				//运行参数初始化
}

/**************************************************************************************************
* 功能：系统参数加载
* 参数：无
* 描述：将数据从eeprom中读取并校验无误后加载到程序中
**************************************************************************************************/
void Sys_Params_Load(void)
{
	uint16_t Buffer[SYS_NUM];
	
	EEPROM_read_n(FLASH_SYS_ADDRESS_PAGE*0x200,(uint8_t *)Buffer,SYS_NUM*2);
	
	if(CRC16((uint8_t *)Buffer, SYS_NUM*2,1) == 0)						//CRC16检验, 如果正确就加载到程序变量里
	{
		my_memcpy((uint8_t *)p_sys, (uint8_t *)Buffer, SYS_NUM*2);
	}
	else																//CRC16检验错误
	{
		Sys_Params_Default();											//16位系统存储参数默认值
		Sys_Params_Save();												//16位系统存储参数保存
	}
}

/**************************************************************************************************
* 功能：系统参数默认值
* 参数：无
* 描述：所有系统参数恢复默认值
**************************************************************************************************/
void Sys_Params_Default(void)
{
	sys.debug1 = 0;
	
	sys.battery_zero = 2316;//电池调零
	sys.battery_full = 3309;//电池调满
	
	sys.mpu_x = -47;		//正值往右偏，负值往左偏
	sys.mpu_y = 13;			//正值往后偏，负值往前偏
	
	sys.hover_P = 1;		//悬停PID比例P
	sys.hover_I = 1;        //悬停PID比例I
	sys.hover_D = 1;        //悬停PID比例D
	
}

/**************************************************************************************************
* 功能：系统参数默认值
* 参数：无
* 描述：除出厂校准外的系统参数恢复默认值（AD、DA）
**************************************************************************************************/
void Sys_Params_Default_Part(void)
{
	sys.debug1 = 0;
	
}

/**************************************************************************************************
* 功能：系统参数保存
* 参数：无
* 描述：将数据校验后写入eeprom中,一页512字节
**************************************************************************************************/
void Sys_Params_Save(void)
{
	sys.crc16_data  = CRC16((uint8_t *)p_sys, (SYS_NUM - 1)*2,1);				//校验
	EEPROM_SectorErase(FLASH_SYS_ADDRESS_PAGE*0x200);							//擦除
	EEPROM_write_n(FLASH_SYS_ADDRESS_PAGE*0x200,(uint8_t *)p_sys,SYS_NUM*2);	//写入
}

/**************************************************************************************************
* 功能：系统参数保存任务
* 参数：无
* 描述：触发保存一次数据
**************************************************************************************************/
void Sys_Params_Save_Task(void)
{
	if(run.save_flag==1)
	{
		run.save_flag=0;
		Sys_Params_Save();
	}
}

/**************************************************************************************************
* 功能：运行参数初始化
* 参数：无
* 描述：无
**************************************************************************************************/
void Run_Params_Init(void)
{
	run.debug1 = 0;
	
	run.telecontrol_direction = 128;
	run.aircraft_direction = 0;
	run.save_flag = 0;
}