#include "platform.h"

/**************************************************************************************************
* 版本：V1.00
* 日期：2024-10-01
* 功能：平台初始化
* 更新：初始版本
* 作者：专业理工男
**************************************************************************************************/

/**************************************************************************************************
* 功能：平台初始化
* 参数：无
* 描述：系统初始化、参数初始化、外设初始化、开始初始化
**************************************************************************************************/
void Platform_Init(void)
{
	System_Init();				//系统初始化
	Params_Init();				//参数初始化
	App_Init();					//外设初始化
	Start_Init();				//开始初始化
	WDT_Init();					//看门狗初始化，如需仿真要注释掉该行
}

/**************************************************************************************************
* 功能：系统初始化
* 参数：无
* 描述：无
**************************************************************************************************/
void System_Init(void)
{
	WTST = 0;  					//设置程序指令延时参数，赋值为0可将CPU执行指令的速度设置为最快
    EAXFR = 1; 					//扩展寄存器(XFR)访问使能
    CKCON = 0; 					//提高访问XRAM速度
	RSTFLAG |= 0x04;   			//设置看门狗复位需要检测P3.2的状态，否则看门狗复位后进入USB下载模式
	
	P0M0 = 0x50; P0M1 = 0x00; 	//P0端口初始化，P04和P06推挽输出，其它准双向IO
	P1M0 = 0x00; P1M1 = 0x08; 	//P1端口初始化，P1.3高阻输入，其它准双向IO
	P2M0 = 0x1d; P2M1 = 0x18; 	//P2端口初始化，P20和P22推挽输出，P2.3和P2.4开漏输出，其它准双向IO
    P3M0 = 0x00; P3M1 = 0x00; 	//P3端口初始化，准双向IO
	P4M0 = 0x00; P4M1 = 0x00; 	//P4端口初始化，准双向IO
    P5M0 = 0x00; P5M1 = 0x00; 	//P5端口初始化，准双向IO
	
	PWM1 = 0;					//初始电机不动
	PWM2 = 0;
	PWM3 = 0;
	PWM4 = 0;
}

/**************************************************************************************************
* 功能：开始初始化
* 参数：无
* 描述：用于确定整个系统的初始状态和参数
**************************************************************************************************/
void Start_Init(void)
{
	
}
